#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

Show Plan

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_dynamodb_table.example_table will be created
  + resource "aws_dynamodb_table" "example_table" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "ArtistId"
      + id               = (known after apply)
      + name             = "MusicCollection"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "Development"
          + "Project"     = "MusicApp"
        }
      + tags_all         = {
          + "Environment" = "Development"
          + "Project"     = "MusicApp"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "ArtistId"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```



*Pusher: @benj58xu, Action: `pull_request`, Workflow: `Pull Request Main`*